[
    {
        "name": "Vavro Šrobár",
        "subtitle": "9. 8. 1867 Lisková – 6. 12. 1950 Olomouc",
        "subtitle2": "(pochovaný v Bratislave)",
        "img": "Vavro_Srobar.jpg",
        "bio": "Politický a verejný činiteľ, publicista, lekár, osobnosť hlasistického hnutia, spolu s Petrom Blahom zakladateľ časopisu Hlas.\n Počas štúdia v Prahe v 90. rokoch 19. storočia mali mimoriadny význam jeho kontakty s Tomášom Garrigue Masarykom, ktoré predurčili jeho dráhu verejného činiteľa, politika, a publicistu. V roku 1901 bol zvolený do výboru Liptovskej stolice a v roku 1906 neúspešne kandidoval do uhorského snemu. V Masarykových intenciách prikladal dôležitosť sociálnej otázke, koncipoval rezolúciu pre zhromaždenie v Liptovskom Mikuláši. 1.5.1918 otvorene žiadal právo na sebaurčenie a pozitívne deklaroval svoj postoj k myšlienke štátnopolitického zväzku Čechov a Slovákov v jednom štáte.\n V dňoch prevratu 1918 sa stal členom predsedníctva Národného výboru čs. Národného Zhromaždenia. V rokoch 1918 – 1925 bol poslancom Národného Zhromaždenia, v rokoch 1925 – 1935 senátorom. Z jeho poverenia sa stal predsedom Dočasnej slovenskej vlády ( 4.11.1918 – 14.11.1918) a zastával viaceré ministerské funkcie. V rokoch 1918 – 1920 bol ministrom s plnou mocou pre správu Slovenska. V tejto funkcii vydal 20.1.1919 nariadenie o rozpustení SNR. V rokoch 1921 – 1922 bol ministrom školstva a národnej osvety. V rokoch 1923 – 1937 pôsobil ako pedagóg na Univerzite Komenského v Bratislave.\n Počas vojny bol aktívny, v auguste 1944 počas Povstania koncipoval Proklamáciu predsedníctva Ústredného národného výboru, ktorý sa neúspešne snažil založiť a uznal SNR za vedúci orgán. Vstúpil do SNR a 1.9.1944 sa stal členom jeho predsedníctva. Po ústupe sa dostal do armády. 30.1.1945 prišiel do Košíc ako člen delegácie SNR. V marci 1945 sa zúčastnil politických rokovaní o zložení novej vlády v Moskve.\n Po vojne sa stal ministrom financií (1945 – 1946) a neskôr ministrom pre zjednotenie zákonov (1948 – 1950). Od roku 1945 bol členom Demokratickej strany a v roku 1946 sa stal predsedom Strany slobody. V rokoch 1948 – 1950 bol členom Ústredného akčného výboru  Národného frontu."
    },
    {
        "name": "Viliam Paulínyi – Tóth",
        "subtitle": "3. jún 1826, Senica – 6. máj 1877, Martin",
        "subtitle2": "",
        "img": "Viliam_Pauliny_Toth.jpg",
        "bio": "Politik, spisovateľ, redaktor, publicista, poručík slovenského dobrovoľníckeho zboru, autor dobovej kresby rozpustenia dobrovoľníckych oddielov v Bratislave.  \n Paulínyi – Tóth patril k najvýznamnejším slovenským politikom 19. storočia. V rokoch 1867 – 1877 bol počas života v Martine iniciátorom a aktívnym činiteľom národných pohybov a podujatí, ktoré sa výrazne prejavili na kultúrnom a hospodárskom raste mesta. \n V roku 1861 bol spoluorganizátorom Memorandového zhromaždenia v Martine a členom slovenskej delegácie, ktorá predložila Memorandum uhorskému snemu. Zaslúžil sa o rozvoj Matice slovenskej, bol členom jej výboru a v rokoch 1866 – 1875 ako úradujúci podpredseda podporoval jej edičnú činnosť."
    }
]