[
    {
        "id": "Vavro_Srobar",
        "name": "Vavro Šrobár",
        "subtitle": "9. 8. 1867 Lisková – 6. 12. 1950 Olomouc",
        "subtitle2": "(pochovaný v Bratislave)",
        "img": "Vavro_Srobar.jpg",
        "bio": "Politický a verejný činiteľ, publicista, lekár, osobnosť hlasistického hnutia, spolu s Petrom Blahom zakladateľ časopisu Hlas.\n Počas štúdia v Prahe v 90. rokoch 19. storočia mali mimoriadny význam jeho kontakty s Tomášom Garrigue Masarykom, ktoré predurčili jeho dráhu verejného činiteľa, politika, a publicistu. V roku 1901 bol zvolený do výboru Liptovskej stolice a v roku 1906 neúspešne kandidoval do uhorského snemu. V Masarykových intenciách prikladal dôležitosť sociálnej otázke, koncipoval rezolúciu pre zhromaždenie v Liptovskom Mikuláši. 1.5.1918 otvorene žiadal právo na sebaurčenie a pozitívne deklaroval svoj postoj k myšlienke štátnopolitického zväzku Čechov a Slovákov v jednom štáte.\n V dňoch prevratu 1918 sa stal členom predsedníctva Národného výboru čs. Národného Zhromaždenia. V rokoch 1918 – 1925 bol poslancom Národného Zhromaždenia, v rokoch 1925 – 1935 senátorom. Z jeho poverenia sa stal predsedom Dočasnej slovenskej vlády ( 4.11.1918 – 14.11.1918) a zastával viaceré ministerské funkcie. V rokoch 1918 – 1920 bol ministrom s plnou mocou pre správu Slovenska. V tejto funkcii vydal 20.1.1919 nariadenie o rozpustení SNR. V rokoch 1921 – 1922 bol ministrom školstva a národnej osvety. V rokoch 1923 – 1937 pôsobil ako pedagóg na Univerzite Komenského v Bratislave.\n Počas vojny bol aktívny, v auguste 1944 počas Povstania koncipoval Proklamáciu predsedníctva Ústredného národného výboru, ktorý sa neúspešne snažil založiť a uznal SNR za vedúci orgán. Vstúpil do SNR a 1.9.1944 sa stal členom jeho predsedníctva. Po ústupe sa dostal do armády. 30.1.1945 prišiel do Košíc ako člen delegácie SNR. V marci 1945 sa zúčastnil politických rokovaní o zložení novej vlády v Moskve.\n Po vojne sa stal ministrom financií (1945 – 1946) a neskôr ministrom pre zjednotenie zákonov (1948 – 1950). Od roku 1945 bol členom Demokratickej strany a v roku 1946 sa stal predsedom Strany slobody. V rokoch 1948 – 1950 bol členom Ústredného akčného výboru  Národného frontu."
    },
    {
        "id": "Viliam_Pauliny_Toth",
        "name": "Viliam Paulínyi – Tóth",
        "subtitle": "3. jún 1826, Senica – 6. máj 1877, Martin",
        "subtitle2": "",
        "img": "Viliam_Pauliny_Toth.jpg",
        "bio": "Politik, spisovateľ, redaktor, publicista, poručík slovenského dobrovoľníckeho zboru, autor dobovej kresby rozpustenia dobrovoľníckych oddielov v Bratislave.  \n Paulínyi – Tóth patril k najvýznamnejším slovenským politikom 19. storočia. V rokoch 1867 – 1877 bol počas života v Martine iniciátorom a aktívnym činiteľom národných pohybov a podujatí, ktoré sa výrazne prejavili na kultúrnom a hospodárskom raste mesta. \n V roku 1861 bol spoluorganizátorom Memorandového zhromaždenia v Martine a členom slovenskej delegácie, ktorá predložila Memorandum uhorskému snemu. Zaslúžil sa o rozvoj Matice slovenskej, bol členom jej výboru a v rokoch 1866 – 1875 ako úradujúci podpredseda podporoval jej edičnú činnosť."
    },
    {
        "id": "Laco_Novomesky_2",
        "name": "Ladislav Novomeský",
        "subtitle": "27. december 1904, Budapešť – 4. september 1976, Bratislava",
        "subtitle2": "",
        "img": "Laco_Novomesky_2.jpg",
        "bio": "Slovenský  komunistický politik, ľavicový intelektuál, spoluzakladateľ DAV-u, básnik, redaktor, novinár a publicista.\n\n Narodil sa v Budapešti, kde za prácou odišli jeho rodičia. Po roku 1919 sa presťahovali naspäť na Slovensko. Študoval na učiteľskom ústave v Modre, kde v roku 1923 zmaturoval. Popri učiteľovaní externe pokračoval v štúdiu na Filozofickej fakulte Univerzity Komenského. V roku 1925 vstúpil do komunistickej strany a odišiel do Ostravy, kde sa stal redaktorom komunistických novín Pravda. Tieto noviny boli od roku 1924 vydávené ako  Pravda chudoby vo Vrútkach. Od roku 1929 pracoval v redakcii Rudého práva v Prahe. Zároveň prispieval do ďalších českých a slovenských ľavicovo orientovaných periodík.\n\n Počas občianskej vojny v Španielsku urobil reportáž z Valencie, Barcelony a Madridu. Hlásil sa k slovenskej avantgardnej ľavicovej skupine davistov, združených okolo časopisu DAV, ktorý vychádzal v rokoch 1924 - 1937. Od roku 1939 žil v Bratislave a pokračoval v komunistickej činnosti. V auguste 1943 sa spolu s Gustavom Husákom stal členom V. ilegálneho vedenia KSS, ktoré viedol Karol Šmidke. Bol jedným z popredných organizátorov SNP, spoluzakladateľom a podpredsedom povstaleckej SNR v Banskej Bystrici (1944).\n\n Po vojne bol členom predsedníctva ÚV KSS a povereníkom pre školstvo a osvetu (1945 – 1950). Na zjazde KSS v roku 1950 bol obvinený z tzv. buržoázneho nacionalizmu a v roku 1951 zatknutý. V roku 1954 bol odsúdený na 10 rokov väzenia v inscenovanom procese s rozvratnou skupinou buržoáznych nacionalistov. V decembri 1955 bol prepustený na podmienku. V roku 1963 bol rehabilitovaný.\n\n Do roku 1962 pracoval v Památníku národního písemnictví v Prahe, po presťahovaní do Bratislavy pracoval v Ústave slovenskej literatúry SAV. Po 21. auguste 1968 sa stal opäť členom Predsedníctva ÚV KSS, v tom istom roku aj predsedom Matice slovenskej. V roku 1970 sa vzdal funkcie v ÚV KSS a krátko na to vážne ochorel. V júli 1970 ho mozgová mŕtvica úplné vyradila zo spoločenského života. Zomrel v Bratislave v roku 1976.\n\n "
    },
    {
        "id": "Jan_Francisci_1",
        "name": "Ján Francisci",
        "subtitle": "",
        "subtitle2": "",
        "img": "Jan_Francisci_1.jpg",
        "bio": ""
    },
    {
        "id": "Jozef_Miloslav_Hurban",
        "name": "Jozef Miloslav Hurban",
        "subtitle": "",
        "subtitle2": "",
        "img": "Jozef_Miloslav_Hurban.jpg",
        "bio": ""
    },
    {
        "id": "Ludovit_Stur",
        "name": "Ľudovít Štúr",
        "subtitle": "",
        "subtitle2": "",
        "img": "Ludovit_Stur.jpg",
        "bio": ""
    },
    {
        "id": "Michal_Hodza",
        "name": "Michal Miloslav Hodža",
        "subtitle": "",
        "subtitle2": "",
        "img": "Michal_Hodza.jpg",
        "bio": ""
    },
    {
        "id": "Viliam_Pauliny_Toth",
        "name": "Viliam Paulínyi – Tóth",
        "subtitle": "3. jún 1826, Senica – 6. máj 1877, Martin",
        "subtitle2": "",
        "img": "Viliam_Pauliny_Toth.jpg",
        "bio": "Politik, spisovateľ, redaktor, publicista, poručík slovenského dobrovoľníckeho zboru, autor dobovej kresby rozpustenia dobrovoľníckych oddielov v Bratislave.  \n Paulínyi – Tóth patril k najvýznamnejším slovenským politikom 19. storočia. V rokoch 1867 – 1877 bol počas života v Martine iniciátorom a aktívnym činiteľom národných pohybov a podujatí, ktoré sa výrazne prejavili na kultúrnom a hospodárskom raste mesta. \n V roku 1861 bol spoluorganizátorom Memorandového zhromaždenia v Martine a členom slovenskej delegácie, ktorá predložila Memorandum uhorskému snemu. Zaslúžil sa o rozvoj Matice slovenskej, bol členom jej výboru a v rokoch 1866 – 1875 ako úradujúci podpredseda podporoval jej edičnú činnosť."
    }
]