[
    {
        "id": "Edvard_Benes",
        "name": "Edvard Beneš",
        "subtitle": "* 28. máj 1884, Kožlany, Rakúsko-Uhorsko",
        "subtitle2": "† 3. september 1948, Sezimovo Ústí, Československo",
        "img": "Edvard_Benes.jpg",
        "bio": "Prof. PhDr. et JUDr. Edvard Beneš bol český politik, diplomat, právnik a filozof, ktorý zastával popredné miesto v prvom česko-slovenskom odboji a následne viaceré vrcholové štátne funkcie v Československu – funkciu ministra zahraničných vecí v rokoch 1918 – 1935, predsedu vlády v rokoch 1921 – 1922 a prezidenta v rokoch 1935 – 1938 a 1939 – 1948, pričom v rokoch 1939 – 1945 bol vedúcim predstaviteľom druhého česko-slovenského odboja (od roku 1940 oficiálne titulovaný ako prezident). \n \n Patril k zástancom ideológie čechoslovakizmu. Po vypuknutí prvej svetovej vojny organizoval český vnútorný odboj proti monarchii, potom odcestoval do Francúzska. Spoločne so Štefánikom získal súhlas dohodových mocností na zakladanie česko-slovenských vojenských jednotiek a prispel tak ku vzniku samostatných légií vo Francúzsku, v Rusku a v Taliansku. Dôležitým výsledkom Benešovej diplomacie bolo uznanie Československej národnej rady ako predstaviteľky nového štátu Francúzskom, Veľkou Britániou a Talianskom. Po vyhlásení Československej republiky bol menovaný ministrom zahraničia. V Paríži okrem iného dohodol nové hranice štátu na juhu Slovenska. \n \n Edvard Beneš pomáhal zakladať Spoločnosť národov, bol jej podpredsedom, členom a predsedom jej Rady (1935). Po abdikácii T. G. Masaryka bol 18. decembra 1935 zvolený za hlavu štátu. Po prijatí Mníchovskej dohody 30. septembra 1938 Beneš 5. októbra abdikoval na funkciu česko-slovenského prezidenta a 22. októbra odletel do Londýna. V júli 1940 v Londýne vytvoril exilovú štátnu reprezentáciu, tzv. dočasné štátne zriadenie (prozatimní čs. státní zřízení) a prevzal funkciu exilového česko-slovenského prezidenta. V priebehu vojny Beneš dosiahol uznanie exilovej vlády všetkými spojencami. Na jar 1945 Beneš odcestoval na oslobodené územie a v Košiciach vymenoval prvú povojnovú vládu, ktorá 5. apríla prijala Košický vládny program. Vo funkcii prezidenta bol potvrdený 28. októbra a následne bol opäť zvolený 19. júna 1946. \n \n Benešova nerozhodnosť vo februári 1948 uľahčila komunistom prevzatie moci v krajine. Nová Gottwaldova vláda už bola – až na Jana Masaryka – komunistická. Dňa 3. septembra 1948 Edvard Beneš zomrel v Sezimovom Ústí."
    },
    {
        "id": "Gustav_Husak",
        "name": "Gustáv Husák",
        "subtitle": "* 10. január 1913, Dúbravka, dnes časť Bratislavy",
        "subtitle2": "† 18. november 1991, Bratislava",
        "img": "Gustav_Husak.jpg",
        "bio": "Najvýznamnejší slovenský komunistický politik druhej polovice 20. storočia. Prešiel vzostupmi (SNP, federácia 1968) aj pádmi (odsúdený ako nacionalista, normalizátor). \n \n Po štúdiu na gymnáziu pokračoval od septembra 1933 v štúdiu na Právnickej fakulte UK. Pracoval ako advokátsky koncipient. Už v roku 1933 vstúpil do komunistickej strany. Husák sa v polovici 30. rokov zaradil k druhej generácii davistov. Počas vojny organizoval stretnutia ľavicových intelektuálov. V roku 1943 sa spolu s Karolom Šmidkem a Ladislavom Novomeským spojili s predstaviteľmi občianskeho odboja Jozefom Lettrichom a Jánom Ursínym (zakladateľmi Demokratickej strany), pričom výsledkom ich vzájomných stretnutí a rokovaní sa v decembri 1943 stala tzv. Vianočná dohoda, ktorá spájala odporcov prvej Slovenskej republiky a pripravila Slovenské národné povstanie. \n \n Husák bol podpredsedom povstaleckej Slovenskej národnej rady a povereníkom pre veci vnútorné. Po oslobodení bol účastníkom rokovaní o obnove ČSR v Moskve (ako vedúci slovenskej delegácie). Po parlamentných voľbách v máji roku 1946 sa Husák v auguste 1946 stal predsedom Zboru povereníkov. V roku 1950 bol s Clementisom, Novomeským a mnohými ďalšími obvinený z „buržoázneho nacionalizmu“. Vo februári roku 1951 bol zatknutý a v apríli roku 1954 súdený vo vykonštruovanom procese s tzv. buržoáznymi nacionalistami. Po amnestii v roku 1960 bol prepustený a pracoval najprv v Pozemných stavbách, neskôr ako vedecký pracovník Ústavu štátu a práva SAV. V roku 1963 bol v plnom rozsahu rehabilitovaný. \n \n V období Pražskej jari vystupoval Husák ako stúpenec Alexandra Dubčeka. V apríli roku 1968 sa stal podpredsedom česko-slovenskej vlády, v ktorej bol jedným z popredných iniciátorov ústavného zákona o federatívnom usporiadaní republiky. Na moskovských rokovaniach v auguste roku 1968 Husák „zmenil kurz“ a stal sa Brežnevovým spojencom. Spolu s Biľakom sa stal symbolom takzvanej politiky normalizácie, ktorá znamenala zastavenie demokratizačných procesov Pražskej jari a návrat k represívnemu komunistickému systému. \n \n V roku 1969 sa Husák dostal na čelo KSČ – do mája roku 1971 bol jej prvým tajomníkom, potom až do roku 1987 jej generálnym tajomníkom. Dňa 29. mája 1975 ho poslanci Federálneho zhromaždenia jednohlasne zvolili aj za prezidenta Československa, čím nahradili Ludvíka Svobodu. \n \n V novembrových dňoch roku 1989 bol jedným z komunistických politikov, ktorí odmietli situáciu riešiť násilím. Po novembrových udalostiach roku 1989 Husák vymenoval 10. decembra 1989 „vládu národného porozumenia“ pod vedením Mariána Čalfu a vzápätí abdikoval z funkcie prezidenta republiky. Zomrel 18. novembra 1991 v Bratislave."
    },
    {
        "id": "Jan_Francisci_1",
        "name": "Ján Francisci",
        "subtitle": "* 1. jún 1822, Hnúšťa",
        "subtitle2": "† 7. marec 1905, Martin",
        "img": "Jan_Francisci_1.jpg",
        "bio": "Spisovateľ, politik, redaktor, prekladateľ, úradník, aktívny účastník revolúcie 1848/1849. \n \n Zúčastnil sa na porade slovenských národovcov v Liptovskom Mikuláši, na ktorej sa sformovali Liptovské žiadosti. Bol spoluorganizátorom národných gárd v Malohonte (so Štefanom Markom Daxnerom a Michalom Bakulínym). Spolu s bratom Karolom bol zatknutý a väznený v Plešivci a v Pešti, po vyslobodení bol od roku 1849 kapitánom slovenského dobrovoľníckeho vojska. \n \n V roku 1861 bol organizátorom a predsedom národného zhromaždenia v Martine, na ktorom prijali Memorandum národa slovenského. Ako predseda dočasného výboru mal zásluhu na vypracovaní stanov Matice slovenskej a v roku 1863 bol zvolený za jej doživotného predsedu. V rokoch 1870 – 1898 bol predsedom miestneho Kníhtlačiarskeho účastníckeho spolku. Až do svojej smrti v roku 1905 pôsobil v Martine, kde bol aj pochovaný na Národnom cintoríne."
    },
    {
        "id": "Jan_Ursiny",
        "name": "Ján Ursíny",
        "subtitle": "* 11. október 1896, Rakša",
        "subtitle2": "† 8. január 1972, Rakša",
        "img": "Jan_Ursiny.jpg",
        "bio": "Slovenský politik a evanjelický cirkevný hodnostár. Bol dozorcom Turčianskeho seniorátu, spoluzakladateľom a prvým dozorcom evanjelického zboru v Prahe. V 30. rokoch 20. storočia sa aktívne angažoval v slovenskom agrárnom hnutí, ktoré zastupoval aj ako poslanec v parlamente. \n \n Bol organizátorom a jedným z priamych iniciátorov Slovenského národného povstania. Po vypuknutí SNP 29. augusta 1944 ako zástupca SNR spolu s Lacom Novomeským bol účastníkom delegácie v Londýne na rokovaniach s Edvardom Benešom a následne v Moskve. Bol dôsledným zástancom princípu rovný s rovným vo veci povojnového života Čechov a Slovákov v Československej republike. Od apríla 1945 bol predsedom Demokratickej strany. \n \n Po vojne sa stal povereníkom poľnohospodárstva a po voľbách 1946 podpredsedom prvej česko-slovenskej povojnovej vlády. V roku 1947 bol zdiskreditovaný komunistami a vo vykonštruovanom procese odsúdený na sedem rokov väzenia. V roku bol 1953 prepustený, no do aktívneho politického života sa už nezapojil. Rehabilitovaný bol v roku 1964. \n \n Patril k najvýznamnejším slovenským politikom prvej polovice 20. storočia, mal mimoriadne silný analytický a geopolitický talent, čo mu často umožnilo správne odhadnúť budúci vývoj politickej situácie v strednej Európe."
    },
    {
        "id": "Jozef_Lettrich",
        "name": "Jozef Lettrich",
        "subtitle": "* 17. jún 1905, Turčianske Teplice, Slovensko",
        "subtitle2": "† 29. november 1969, New York, USA",
        "img": "Jozef_Lettrich.jpg",
        "bio": "Slovenský politik, signatár Vianočnej dohody v decembri 1943. Študoval na gymnáziu v Martine, v rokoch 1928 – 1929 na Právnickej fakulte UK v Bratislave. Pôvodným povolaním právnik (v rokoch 1941 – 1944 advokát v Bratislave). V medzivojnovom období člen Agrárnej strany. \n \n Od roku 1939 bol činný v protifašistickom odboji, v rokoch 1943 – 1944 bol členom ilegálnej a v roku 1944 povstaleckej Slovenskej národnej rady. Od 1. septembra 1944 pôsobil ako povereník pre školstvo a osvetu v Banskej Bystrici. V rokoch 1945 – 1948 bol predsedom Demokratickej strany (od júla 1945 nahradil Jána Ursíniho), predsedom SNR a poslancom Národného zhromaždenia. Dňa 26. februára 1948 bol donútený rezignovať na funkciu predsedu SNR. \n \n V marci 1948 s bratom emigroval cez Rakúsko do USA, kde pôsobil v exilových organizáciách, napr. v Rade slobodného Česko-Slovenska, a publikoval v exilovej (krajanskej) i americkej tlači. Zomrel 29. novembra 1969 v americkom New Yorku a pochovali ho na česko-slovenskom cintoríne v Chicagu."
    },
    {
        "id": "Jozef_Miloslav_Hurban",
        "name": "Jozef Miloslav Hurban",
        "subtitle": "* 19. marec 1817, Beckov, okres Trenčín",
        "subtitle2": "† 21. február 1888, Hlboké, okres Senica",
        "img": "Jozef_Miloslav_Hurban.jpg",
        "bio": "Evanjelický farár, politik, spisovateľ, vydavateľ a publicista. \n \n Jozef Miloslav Hurban sa narodil v rodine evanjelického farára v Beckove. Doma získal základy vzdelania, potom navštevoval školu v Trenčíne a lýceum v Bratislave. Tu sa stretol so skupinou národne uvedomelých študentov – Slovákov sústredených okolo Katedry reči a literatúry česko-slovenskej a v Spoločnosti česko-slovanskej, samovzdelávacom spolku. Po vysvätení za kňaza bol najprv kaplánom v Brezovej pod Bradlom a od roku 1843 farárom v Hlbokom, kde pôsobil až do svojej smrti. \n \n Hurban bol v počiatkoch svojej činnosti súpútnikom Ľudovíta Štúra, jeho spolubojovníkom za práva Slovákov. Podieľal sa na vypracovaní základov spisovnej slovenčiny, vydával almanach Nitra, bol aj literárne činný. Bol autorom revolučných výziev k Slovákom a základných dokumentov revolúcie 1848 – 1849. Počas slovenského povstania bol veliteľom a vodcom slovenského dobrovoľníckeho vojska a prvým predsedom Slovenskej národnej rady. \n \n Po smrti Ľudovíta Štúra stál Hurban na čele slovenského politického verejného a literárneho života takmer pol storočia. Aktivizoval sa najmä po páde Bachovho absolutizmu. V roku 1861 bol spolutvorcom Memoranda národa slovenského. Stal sa členom memorandového výboru, memorandového vyslanectva, bol hlavným obhajcom Daxnerovej koncepcie štátoprávneho riešenia slovenskej otázky, no taktiež sa stal zakladajúcim členom a výborníkom Matice slovenskej. Po celý život bol nekompromisným bojovníkom za národné práva Slovákov a priekopníkom slovanskej vzájomnosti."
    },
    {
        "id": "Karol_Smidke",
        "name": "Karol Šmidke",
        "subtitle": "* 21. január 1897, Vítkovice, dnes časť Ostravy, Česko",
        "subtitle2": "† 15. december 1952, Bratislava",
        "img": "Karol_Smidke.jpg",
        "bio": "Slovenský politik a funkcionár komunistickej strany. \n \n Od polovice 20. rokov pracoval v rôznych funkciách straníckeho aparátu KSČ. Z poverenia KSČ v roku 1939 emigroval cez Poľsko do ZSSR. Spolu s Karolom Bacílkom bol 22. júna 1943 vyslaný cez Poľsko späť na Slovensko. Moskovské vedenie žiadalo od slovenských komunistov, aby vystupňovali svoju aktivitu v boji proti fašistom. Založil a viedol V. ilegálne ústredné vedenie KSS, do ktorého prijal Gustáva Husáka a Laca Novomeského. Bol signatárom Vianočnej dohody, ktorá v decembri 1943 vytvorila ilegálnu SNR. Tá sa neskôr stala vedúcim orgánom protifašistického odboja na Slovensku. \n \n Po vojne patril medzi najvýznamnejších slovenských politikov. Vykonával viacero vysokých štátnych a straníckych funkcií. V rokoch 1945 – 1951 bol členom Ústredného výboru KSS. \n \n V rokoch 1944 – 1945 spolupredsedal SNR spolu s Vavrom Šrobárom. V rokoch 1948 – 1950 bol predsedom SNR a v rokoch 1945 – 1946 predsedom Zboru povereníkov. \n \n Jeho politická kariéra bola zastavená v roku 1950, keď bol obvinený z buržoázneho nacionalizmu a musel sa stiahnuť z politického života. Šmidke zomrel v Bratislave 15. decembra 1952 vo veku 55 rokov za nevyjasnených okolností. Vyhol sa tak procesu s rozvratnou skupinou buržoáznych nacionalistov na Slovensku v apríli 1954, v ktorom boli odsúdení Husák a Novomeský."
    },
    {
        "id": "Laco_Novomesky_2",
        "name": "Ladislav Novomeský",
        "subtitle": "* 27. december 1904, Budapešť",
        "subtitle2": "† 4. september 1976, Bratislava",
        "img": "Laco_Novomesky_2.jpg",
        "bio": "Slovenský komunistický politik, ľavicový intelektuál, spoluzakladateľ DAV-u, básnik, redaktor, novinár a publicista. \n \n Narodil sa v Budapešti, kam za prácou odišli jeho rodičia. Po roku 1919 sa presťahovali naspäť na Slovensko. Študoval na Učiteľskom ústave v Modre, kde v roku 1923 zmaturoval. Popri učení externe pokračoval v štúdiu na Filozofickej fakulte Univerzity Komenského. V roku 1925 vstúpil do komunistickej strany a odišiel do Ostravy, kde sa stal redaktorom komunistických novín Pravda. Tieto noviny boli od roku 1924 vydávené ako Pravda chudoby vo Vrútkach. Od roku 1929 pracoval v redakcii Rudého práva v Prahe. Zároveň prispieval do ďalších českých a slovenských ľavicovo orientovaných periodík. \n \n Počas občianskej vojny v Španielsku urobil reportáž z Valencie, Barcelony a Madridu. Hlásil sa k slovenskej avantgardnej ľavicovej skupine davistov združených okolo časopisu DAV, ktorý vychádzal v rokoch 1924 – 1937. Od roku 1939 žil v Bratislave a pokračoval v komunistickej činnosti. V auguste 1943 sa spolu s Gustavom Husákom stal členom V. ilegálneho vedenia KSS, ktoré viedol Karol Šmidke. Bol jedným z popredných organizátorov SNP, spoluzakladateľom a podpredsedom povstaleckej SNR v Banskej Bystrici (1944). \n \n Po vojne bol členom predsedníctva ÚV KSS a povereníkom pre školstvo a osvetu (1945 – 1950). Na zjazde KSS v roku 1950 bol obvinený z tzv. buržoázneho nacionalizmu a v roku 1951 zatknutý. V roku 1954 bol odsúdený na 10 rokov väzenia v inscenovanom procese s rozvratnou skupinou buržoáznych nacionalistov. V decembri 1955 bol prepustený na podmienku. V roku 1963 bol rehabilitovaný. \n \n Do roku 1962 pracoval v Pamätníku národného písomníctva v Prahe, po presťahovaní do Bratislavy pracoval v Ústave slovenskej literatúry SAV. Po 21. auguste 1968 sa stal opäť členom predsedníctva ÚV KSS, v tom istom roku aj predsedom Matice slovenskej. V roku 1970 sa vzdal funkcie v ÚV KSS a krátko na to vážne ochorel. V júli 1970 ho mozgová mŕtvica úplne vyradila zo spoločenského života. Zomrel v Bratislave v roku 1976."
    },
    {
        "id": "Ludovit_Stur",
        "name": "Ľudovít Štúr",
        "subtitle": "* 29. október 1815, Uhrovec, okres Topoľčany",
        "subtitle2": "† 12. január 1856, Modra",
        "img": "Ludovit_Stur.jpg",
        "bio": "Politik, kodifikátor slovenčiny, novinár, pedagóg, vedec, básnik a vedúca postava slovenského povstania 1848 – 1849. \n \n Štúr sa narodil v rodine národne uvedomelého učiteľa. V rodnej obci a v rodine získal základy vzdelania, ktoré si neskôr rozšíril na lýceu v Rábe a najmä v Bratislave. Na lýceu existovala od roku 1803 Katedra reči a literatúry česko-slovenskej. Študenti lýcea si založili aj Spoločnosť česko-slovanskú, samovzdelávací spolok, ktorého aktívnym členom bol aj Štúr. Univerzitné štúdiá absolvoval v Halle. Po návrate do domoviny aktívne pôsobil v slovenskom národnom hnutí. Spolu s Jozefom Miloslavom Hurbanom a Michalom Miloslavom Hodžom sa v roku 1843 rozhodli pre zavedenie slovenčiny do praxe, za jej základ si zvolili stredoslovenské nárečie. \n \n V roku 1846 vydal Štúr dokument Nárečja Slovenskuo alebo potreba písaňja v tomto nárečí, v ktorom obhajoval nevyhnutnosť nového spisovného jazyka. V roku 1845 začal vydávať prvé slovenské politické noviny – Slovenskje národňje novini. O dva roky neskôr bol zvolený za poslanca uhorského snemu za mesto Zvolen. Vo svojich snemových vystúpeniach požadoval zrušenie poddanstva, uzákonenie demokratických práv a slobôd i rovnoprávnosť národov Uhorska. \n \n Ľudovít Štúr bol jedným z prvých, kto sformuloval ideu vytvorenia samostatnej slovenskej provincie v rámci habsburskej monarchie. Jeho životným snažením bolo povzniesť Slovákov ako svojbytný národ na úroveň moderných európskych národov. Za tieto idey bojoval aj v revolučných rokoch 1848 – 1849, keď už bol uznávaným a rešpektovaným vodcom slovenského národného hnutia. Spoluzakladal Slovenskú národnú radu a organizoval slovenské dobrovoľnícke vojsko. Po potlačení revolúcie žil pod policajným dozorom v Modre, kde v januári 1856 zomrel."
    },
    {
        "id": "Matus_Dula",
        "name": "Matúš Dula",
        "subtitle": "* 28. jún 1846, Blatnica",
        "subtitle2": "† 13. jún 1926 Ružomberok, pochovaný v Martine",
        "img": "Matus_Dula.jpg",
        "bio": "Advokát, publicista, politik, spolupredseda Matice slovenskej. \n \n Už ako študent sa angažoval v národno-kultúrnom pohybe. V roku 1863 bol účastníkom zakladajúceho valného zhromaždenia Matice slovenskej a v roku 1864 spoluzakladateľom akademického spolku Slovenské okolie vo Viedni. \n \n Po usadení v Martine sa plne venoval politike, viac ako štyri desaťročia patril k vedúcim predstaviteľom Slovenskej národnej strany a od roku 1914 bol jej predsedom. Inicioval vybudovanie Národného domu v Martine. Bol spoluzakladateľom, akcionárom a funkcionárom správnych orgánov Tatra banky, sporiteľne, celulózky a iných podnikov v Martine. Jeho základnou koncepciou zostávala slovanská vzájomnosť a obrana samobytnosti slovenského národa – požiadavky Memoranda slovenského národa."
    },
    {
        "id": "Michal_Hodza",
        "name": "Michal Miloslav Hodža",
        "subtitle": "* 22. september 1811, Rakša, okres Turčianske Teplice",
        "subtitle2": "† 26. marec 1870, Český Těšín",
        "img": "Michal_Hodza.jpg",
        "bio": "Evanjelický farár, spisovateľ, jazykovedec a jeden z najvýznamnejších spolupracovníkov Ľudovíta Štúra. \n \n Pochádzal z rodiny slobodného roľníka. Študoval v Rakši, Mošovciach, na gymnáziu v Banskej Bystrici, v Rožňave a v Prešove. Na Evanjelickom lýceu v Bratislave študoval teológiu, zapojil sa do aktivít Spoločnosti reči a literatúry československej. Štúdiá ukončil vo Viedni, kde bol v roku 1837 vysvätený za kňaza. \n \n V roku 1842 sa definitívne usadil v Liptovskom Mikuláši, kde až do roku 1866 pôsobil ako evanjelický farár. Bol členom posolstva slovenských evanjelických vzdelancov k cisárovi. V lete roku 1843 sa stretol so Štúrom a s Hurbanom v Hlbokom, kde spolurozhodoval o podobe spisovnej slovenčiny a o vydávaní slovenských novín. Na stretnutí v Liptovskom Mikuláši v auguste 1844 založili kultúrno-vzdelávací spolok Tatrín a Hodža sa stal jeho prvým predsedom. \n \n Hodža bol jedným zo spoluorganizátorov stretnutia slovenských národovcov v máji 1848 v Liptovskom Mikuláši, kde boli za prítomnosti Štúra a Hurbana schválené Žiadosti slovenského národa, ktoré obsahovali návrhy na riešenie postavenia slovenského národa v rámci Uhorska. Stal sa členom prvej Slovenskej národnej rady. Aktívne sa zúčastnil na rokovaniach Slovanského zjazdu v Prahe. Bol aktívnym účastníkom slovenských dobrovoľníckych výprav v rokoch 1848 – 1849. \n \n Po porážke revolúcie pôsobil Hodža naďalej v Liptovskom Mikuláši. Bol zakladajúcim členom a výborníkom Matice slovenskej. V roku 1866 bol suspendovaný a nútený opustiť faru. Od roku 1867 žil na penzii v exile v Těšíne, kde sa venoval iba literárnej činnosti. Začiatkom roka 1870 ochorel a krátko na to zomrel. Pochovaný bol v Těšíne, no v roku 1922 boli jeho pozostatky prevezené do Liptovského Mikuláša."
    },
    {
        "id": "Milan_Hodza",
        "name": "Milan Hodža",
        "subtitle": "* 1. február 1878, Sučany",
        "subtitle2": "† 27. jún 1944, Clearwater, USA",
        "img": "Milan_Hodza.jpg",
        "bio": "Jeden z najvýznamnejších slovenských politikov prvej polovice 20. storočia. \n \n Politickú kariéru začal ešte počas monarchie ako poslanec uhorského snemu (1905 – 1910) za Báčsko-kulpínsky okres (dnes Srbsko). Presadzoval vzájomnú spoluprácu nemaďarských národov. Za Rakúsko-Uhorska pôsobil v rámci Slovenskej národnej strany, neskôr sa usiloval o vytvorenie Agrárnej strany a bol jej najvýznamnejším predstaviteľom na Slovensku. Vydával periodiká Slovenský denník a Slovenský týždenník. \n \n V roku 1918 bol členom Slovenskej národnej rady a signatárom Martinskej deklarácie. Po vzniku ČSR sa stal splnomocneným zástupcom československej vlády v Budapešti a v roku 1919 štátnym tajomníkom na ministerstve vnútra v Prahe. Od roku 1919 pôsobil postupne vo funkciách ministra unifikácie, poľnohospodárstva, školstva a národnej osvety i zahraničných vecí. Bol jedným z iniciátorov regionalistického hnutia usilujúceho o ochranu hospodárskych záujmov Slovenska voči centru. Bol tiež spoluzakladateľom a vedúcim činiteľom Medzinárodného a agrárneho byra európskych agrárnych strán. \n \n V rokoch 1935 – 1938 bol prvým Slovákom vo funkcii predsedu vlády Československej republiky. Po roku 1938 zostal vo Švajčiarsku, kde bol na liečení. Počas emigrácie založil v Paríži Slovenskú národnú radu a stal sa jej predsedom. V roku 1940 emigroval do Londýna a v roku 1941 do USA, kde o tri roky neskôr zomrel. V roku 2002 boli jeho ostatky prevezené do Martina."
    },
    {
        "id": "Milan_Rastislav_Stefanik_1",
        "name": "Milan Rastislav Štefánik",
        "subtitle": "* 21. júl 1880, Košariská, Rakúsko-Uhorsko",
        "subtitle2": "† 4. máj 1919, Ivanka pri Dunaji, Československo",
        "img": "Milan_Rastislav_Stefanik_1.jpg",
        "bio": "Gen. PhDr. Milan Rastislav Štefánik bol slovenský astronóm, fotograf, vojenský letec, brigádny generál ozbrojených síl Francúzska, diplomat a politik. \n \n Narodil sa v Košariskách v rodine evanjelického farára Pavla Štefánika. Základy vzdelania získal doma. Maďarčine sa priúčal v Šamoríne, potom pokračoval v štúdiu na evanjelickom lýceu v Bratislave, Šoproni a v Sarvaši, kde maturoval. Po maturite odišiel študovať do Prahy odbor stavebné inžinierstvo. Po roku sa rozhodol pre štúdium astronómie na filozofickej fakulte. V Prahe sa zapojil do činnosti spolku slovenských študentov Detvan, kde sa zoznámil s hlasistami, ktorí boli pod ideovým vplyvom myšlienok Tomáša Garriguea Masaryka, vtedy profesora Karlovej univerzity. Štúdium ukončil v roku 1904. \n \n Krátko po ukončení štúdií odišiel do Francúzska, kde pracoval u astronóma prof. Jansena. V službách francúzskej vlády precestoval ako astronóm takmer celý svet. Po vypuknutí „veľkej vojny“ vstúpil ako vojenský pilot do armády, neskôr pracoval pre meteorologickú službu. Už ako armádny príslušník v Paríži nadväzoval spoločenské a politické kontakty, ktoré využíval na presadzovanie myšlienky vzniku česko-slovenského štátu. V roku 1915 zakladal spolu s Edvardom Benešom Československú národnú radu v Paríži. \n \n Svoje kontakty vo vysokých francúzskych politických kruhoch Štefánik intenzívne využíval na ustanovenie samostatného česko-slovenského vojska (česko-slovenských légií) a sprostredkovanie kontaktov na francúzskych politikov pre ostatné osobnosti česko-slovenského zahraničného odboja. Spolu s Masarykom a Benešom bol kľúčovou osobou pri vzniku ČSR. Štefánik bol ministrom vojny v dočasnej vláde československej a následne aj v novovzniknutej ČSR. \n \n Tragicky zahynul pri návrate do vlasti 4. mája 1919. Jeho lietadlo sa zrútilo neďaleko Ivanky pri Dunaji. Bol pochovaný nad svojou rodnou obcou Košariská na vrchu Bradlo. Na Štefánikovom hrobe bola neskôr vybudovaná mohyla od architekta Dušana Jurkoviča."
    },
    {
        "id": "Pavol_Blaho",
        "name": "Pavol Blaho",
        "subtitle": "* 25. marec 1867, Skalica",
        "subtitle2": "† 29. november 1927, Bratislava, pochovaný v Skalici",
        "img": "Pavol_Blaho.jpg",
        "bio": "Politik, verejný, hospodársky a kultúrny činiteľ, redaktor, publicista. \n \n V rokoch 1906 – 1918 bol poslancom uhorského snemu za volebný okres Moravský Ján. Následne sa v roku 1918 stal členom Revolučného národného zhromaždenia a povereníkom Československej národnej vlády pre politickú administratívu a poľnohospodárstvo v prvej dočasnej vláde na Slovensku. Neskôr bol referentom pre poľnohospodárstvo na Ministerstve s plnou mocou pre správu Slovenska. Spolu s Milanom Hodžom bol predstaviteľom raného agrarizmu na Slovensku. \n \n Ako významný poprevratový činiteľ slovenského agrárneho hnutia predsedal od roku 1919 Národnej a republikánskej strane roľníckej. Bol predstaviteľom konzervatívneho krídla Republikánskej strany poľnohospodárskeho a maloroľníckeho ľudu na Slovensku. Založil rôzne spolky (napr. spolok triezvosti), knižnice a tiež múzeum v Skalici."
    },
    {
        "id": "Pavol_Mudron",
        "name": "Pavol Mudroň",
        "subtitle": "* 9. december 1835, Čabradský Vrbovok",
        "subtitle2": "† 9. marec 1914, Těšín, pochovaný v Martine",
        "img": "Pavol_Mudron.jpg",
        "bio": "Právnik, národnokultúrny pracovník, politik. \n \n V roku 1861 bol spoluorganizátorom a zapisovateľom memorandového zhromaždenia, v roku 1863 spoluzakladateľom a tajomníkom Matice slovenskej. Aktivizoval sa ako spoluzakladateľ viacerých slovenských finančných a hospodárskych podnikov – Sporiteľňa, Tatra banka. Vydával Národné noviny a predsedal ich konzorciu. Vydával aj Slovenské pohľady. \n \n Od roku 1877 bol predsedom Slovenskej národnej strany. Podieľal sa na formovaní cieľov slovenskej politiky, ktorej hlavnými zásadami boli štúrovské ideály, myšlienka slovanskej vzájomnosti, presadzovanie svojbytnosti slovenského národa, orientácia na cárske Rusko a spolupráca s českým národným hnutím. Za svoje aktivity bol viackrát perzekvovaný a väznený."
    },
    {
        "id": "Svetozar_Hurban_Vajansky_1",
        "name": "Svetozár Hurban Vajanský",
        "subtitle": "* 16. január 1847, Hlboké",
        "subtitle2": "† 17. august 1916, Martin",
        "img": "Svetozar_Hurban_Vajansky_1.jpg",
        "bio": "Spisovateľ, publicista, redaktor, národný a politický dejateľ. \n \n Redaktor Národných novín v Martine, časopisu Orol a Slovenských pohľadov, ktorých bol v rokoch 1890 – 1916 aj majiteľom. Politicky inklinoval k predstaviteľom Starej školy slovenskej – Viliamovi Paulinymu-Tóthovi či Jánovi Franciscimu. Od roku 1878 bol hlavným reprezentantom martinského vedenia Slovenskej národnej strany a jej tlačového orgánu Národných novín. Aktívne oživoval myšlienku slovanskej vzájomnosti. \n \n Vajanský udržiaval úzke kontakty s predstaviteľmi českého národa. V roku 1887 sa zoznámil s Tomášom Garrigueom Masarykom, s ktorým mal najmä pre jeho koncepciu jednotného československého národa a jazyka viaceré nedorozumenia. Propagoval myšlienku spolupráce utláčaných národov Uhorska. Patril k hlavným iniciátorom Národnostného kongresu v roku 1895 v Budapešti. \n \n V Martine sa aktivizoval ako funkcionár v rôznych kultúrnych spolkoch a ustanovizniach – v Kníhtlačiarskom účastinárskom spolku, Slovenskom spevokole, Živene. V publicistike reagoval na aktuálne politické a kultúrne problémy a za túto činnosť bol viackrát súdený a väznený."
    },
    {
        "id": "Stefan_Moyzes",
        "name": "Štefan Moyzes",
        "subtitle": "* 24. október 1797, Veselé",
        "subtitle2": "† 5. júl 1869, Žiar nad Hronom",
        "img": "Stefan_Moyzes.jpg",
        "bio": "Národnokultúrny pracovník, spisovateľ, cirkevný hodnostár. \n \n Od študentských čias sa zapájal do národných pohybov. V rokoch 1848 – 1849 sa zblížil so štúrovcami, ktorým preukazoval všestrannú pomoc najmä počas týchto revolučných rokov. \n \n Jeho činnosť vyvrcholila v období memorandovo-matičného obdobia. V roku 1861 sa politicky stotožnil s programom Memoranda a v podobe Viedenského memoranda ho predložil panovníkovi, od ktorého vymohol úradné povolenie na založenie Matice slovenskej. Na jej ustanovujúcom valnom zhromaždení 4. augusta 1863 ho zvolili za prvého predsedu. V roku 1864 predsedal druhému a v roku 1865 tretiemu valnému zhromaždeniu. V predsedníckej funkcii zotrval až do smrti."
    },
    {
        "id": "tomas_garrigue_masaryk",
        "name": "Tomáš Garrigue Masaryk",
        "subtitle": "* 7. marec 1850, Hodonín",
        "subtitle2": "† 14. september 1937, Lány",
        "img": "tomas_garrigue_masaryk.jpg",
        "bio": "Československý štátnik, filozof, sociológ a pedagóg, prvý prezident Československej republiky. \n \n Masaryk pochádzal z chudobnej rodiny. Po štúdiu v Strážnici a v Brne pokračoval v štúdiách na univerzite vo Viedni. Po vzniku Českej univerzity v Prahe bol v roku 1882 menovaný profesorom filozofie. V roku 1890 vstúpil Masaryk do Mladočeskej strany a následne bol zvolený za poslanca Ríšskej rady. V roku 1900 založil Českú stranu pokrokovú. V rokoch 1907 a 1911 bol znovuzvolený za ríšskeho poslanca. \n \n Masaryk využil svoje bohaté kontakty, znalosti a skúsenosti a po roku 1914 prostredníctvom Roberta Williama Setona-Watsona a ďalších osobností zoznamoval svetovú verejnosť s českými požiadavkami. V roku 1915 odišiel do Švajčiarska. Vrátiť sa už nemohol, pretože v Rakúsko-Uhorsku bol na neho vydaný zatykač. Jeho spojkou s domovom sa stal Edvard Beneš. Rozšíril kontakty s českými krajanmi v zahraničí. \n \n V júni 1915 Masaryk po prvýkrát verejne vyhlásil požiadavku samostatného štátu. V roku 1916 mu Milan Rastislav Štefánik pripravil prijatie u francúzskeho premiéra Aristida Brianda v Paríži. Vo februári 1917 odišiel Masaryk do Ruska zhromažďovať vojsko. Česko-slovenské légie postupne dosiahli stav až 50-tisíc mužov. Správa o udalostiach v Prahe a vzniku Československa 28. októbra 1918 zastihla Masaryka v Amerike, ako aj správa o jeho zvolení za prezidenta. \n \n Masaryk bol za prezidenta zvolený opakovane v rokoch 1920, 1927 a 1934. Koncom roku 1935 Masaryk zo zdravotných dôvodov abdikoval a 14. septembra 1937 zomrel."
    },
    {
        "id": "Viliam_Pauliny_Toth",
        "name": "Viliam Pauliny-Tóth",
        "subtitle": "* 3. jún 1826, Senica",
        "subtitle2": "† 6. máj 1877, Martin",
        "img": "Viliam_Pauliny_Toth.jpg",
        "bio": "Politik, spisovateľ, redaktor, publicista, poručík slovenského dobrovoľníckeho zboru, autor dobovej kresby rozpustenia dobrovoľníckych oddielov v Bratislave. \n \n Pauliny-Tóth patril k najvýznamnejším slovenským politikom 19. storočia. V rokoch 1867 – 1877 bol počas života v Martine iniciátorom a aktívnym činiteľom národných pohybov a podujatí, ktoré sa výrazne prejavili na kultúrnom a hospodárskom raste mesta. \n \n V roku 1861 bol spoluorganizátorom memorandového zhromaždenia v Martine a členom slovenskej delegácie, ktorá predložila Memorandum uhorskému snemu. Zaslúžil sa o rozvoj Matice slovenskej, bol členom jej výboru a v rokoch 1866 – 1875 ako úradujúci podpredseda podporoval jej edičnú činnosť."
    },
    {
        "id": "Vavro_Srobar",
        "name": "Vavro Šrobár",
        "subtitle": "* 9. august 1867, Lisková",
        "subtitle2": "† 6. december 1950, Olomouc, pochovaný v Bratislave",
        "img": "Vavro_Srobar.jpg",
        "bio": "Politický a verejný činiteľ, publicista, lekár, osobnosť hlasistického hnutia, spolu s Petrom Blahom zakladateľ časopisu Hlas. \n \n Počas štúdia v Prahe v 90. rokoch 19. storočia mali mimoriadny význam jeho kontakty s Tomášom Garrigueom Masarykom, ktoré predurčili jeho dráhu verejného činiteľa, politika, a publicistu. V roku 1901 bol zvolený do výboru Liptovskej stolice a v roku 1906 neúspešne kandidoval do uhorského snemu. V Masarykových intenciách prikladal dôležitosť sociálnej otázke, koncipoval rezolúciu pre zhromaždenie v Liptovskom Mikuláši. Dňa 1. mája 1918 otvorene žiadal právo na sebaurčenie a pozitívne deklaroval svoj postoj k myšlienke štátnopolitického zväzku Čechov a Slovákov v jednom štáte. \n \n V dňoch prevratu 1918 sa stal členom predsedníctva Národného výboru Československého národného zhromaždenia. V rokoch 1918 – 1925 bol poslancom Národného zhromaždenia, v rokoch 1925 – 1935 senátorom. Z jeho poverenia sa stal predsedom dočasnej slovenskej vlády (4. november 1918 – 14. november 1918) a zastával viaceré ministerské funkcie. V rokoch 1918 – 1920 bol ministrom s plnou mocou pre správu Slovenska. V tejto funkcii vydal 20. januára 1919 nariadenie o rozpustení SNR. V rokoch 1921 – 1922 bol ministrom školstva a národnej osvety. V rokoch 1923 – 1937 pôsobil ako pedagóg na Univerzite Komenského v Bratislave. \n \n Počas vojny bol aktívny, v auguste 1944 počas Povstania koncipoval Proklamáciu predsedníctva Ústredného národného výboru, ktorý sa neúspešne snažil založiť, a uznal SNR za vedúci orgán. Vstúpil do SNR a 1. septembra 1944 sa stal členom jej predsedníctva. Po ústupe sa dostal do armády. Dňa 30. januára 1945 prišiel do Košíc ako člen delegácie SNR. V marci 1945 sa zúčastnil politických rokovaní o zložení novej vlády v Moskve. \n \n Po vojne sa stal ministrom financií (1945 – 1946) a neskôr ministrom pre zjednotenie zákonov (1948 – 1950). Od roku 1945 bol členom Demokratickej strany a v roku 1946 sa stal predsedom Strany slobody. V rokoch 1948 – 1950 bol členom Ústredného akčného výboru Národného frontu."
    }
]